//------------------------------------------------------------------------------
// circle.cpp - содержит функции обработки круга
//------------------------------------------------------------------------------

#include "circle.h"

//------------------------------------------------------------------------------
// Ввод параметров треугольника из потока
void In(circle &c, ifstream &ifst) {
    int color_code;
    ifst >> c.x >> c.y >> c.r >> color_code;
    c.col = colors[color_code];
}

// Случайный ввод параметров треугольника
void InRnd(circle &c) {
  c.x = Random();
  c.y = Random();
  c.r = Random();
  c.col = colors[Random() % 7];
}


//------------------------------------------------------------------------------
// Вывод параметров треугольника в поток
void Out(circle &c, ofstream &ofst) {
    ofst << "It is Circle:    x = "
        << "(" << c.x << ", " << c.y << ") r = " << c.r
        << ". Area = " << Area(c)
        << ". Color = " << GetColor(c) << "\n";
}

//------------------------------------------------------------------------------
// Вычисление периметра треугольника
double Area(circle &t) {
    return t.r * t.r * 3.14159265358979323846;
}

color GetColor(circle& c) {
    return c.col;
}
